test/loadtest/downloadrequest.yml
config:
  target: "http://localhost:3001"
  http:
    timeout: 10
  environments:
    production:
      target: "https://causalpath.org"
      http:
        timeout: 1000
    staging:
      target: "http://35.192.108.199:3001"
      http:
        timeout: 1000
    local:
      target: "http://localhost:3001"
  phases:
    - duration: 1
      arrivalRate: 1
      name: Load
  # processor: "./processor.js"
  payload:
      # path is relative to the location of the test script
      path: "analyzed_rooms_{{ $environment }}.txt"
      fields:
        - "room"
scenarios:
  - flow:
    # TODO: see if artilaryio provides a way of doing this without repeating the same code
    # arrivalCount did not seem to work for that in my first trial
    - post:
        url: "/api/downloadRequest"
        # beforeRequest: makeDownloadRequestVars
        json:
          room: "{{ room }}"
    - think: 2
    - post:
        url: "/api/downloadRequest"
        # beforeRequest: makeDownloadRequestVars
        json:
          room: "{{ room }}"
    - think: 2
    - post:
        url: "/api/downloadRequest"
        # beforeRequest: makeDownloadRequestVars
        json:
          room: "{{ room }}"
    - think: 2
    - post:
        url: "/api/downloadRequest"
        # beforeRequest: makeDownloadRequestVars
        json:
          room: "{{ room }}"
    - think: 2
    - post:
        url: "/api/downloadRequest"
        # beforeRequest: makeDownloadRequestVars
        json:
          room: "{{ room }}"
    - think: 2
    - post:
        url: "/api/downloadRequest"
        # beforeRequest: makeDownloadRequestVars
        json:
          room: "{{ room }}"
    - think: 2
    - post:
        url: "/api/downloadRequest"
        # beforeRequest: makeDownloadRequestVars
        json:
          room: "{{ room }}"
    - think: 2
    - post:
        url: "/api/downloadRequest"
        # beforeRequest: makeDownloadRequestVars
        json:
          room: "{{ room }}"
    - think: 2
    - post:
        url: "/api/downloadRequest"
        # beforeRequest: makeDownloadRequestVars
        json:
          room: "{{ room }}"
    - think: 2
    - post:
        url: "/api/downloadRequest"
        # beforeRequest: makeDownloadRequestVars
        json:
          room: "{{ room }}"
    - think: 2
    - post:
        url: "/api/downloadRequest"
        # beforeRequest: makeDownloadRequestVars
        json:
          room: "{{ room }}"
    - think: 2
    - post:
        url: "/api/downloadRequest"
        # beforeRequest: makeDownloadRequestVars
        json:
          room: "{{ room }}"
    - think: 2
    - post:
        url: "/api/downloadRequest"
        # beforeRequest: makeDownloadRequestVars
        json:
          room: "{{ room }}"
    - think: 2
    - post:
        url: "/api/downloadRequest"
        # beforeRequest: makeDownloadRequestVars
        json:
          room: "{{ room }}"
    - think: 2
    - post:
        url: "/api/downloadRequest"
        # beforeRequest: makeDownloadRequestVars
        json:
          room: "{{ room }}"
    - think: 2
    - post:
        url: "/api/downloadRequest"
        # beforeRequest: makeDownloadRequestVars
        json:
          room: "{{ room }}"
    - think: 2
    - post:
        url: "/api/downloadRequest"
        # beforeRequest: makeDownloadRequestVars
        json:
          room: "{{ room }}"
    - think: 2
    - post:
        url: "/api/downloadRequest"
        # beforeRequest: makeDownloadRequestVars
        json:
          room: "{{ room }}"
    - think: 2
    - post:
        url: "/api/downloadRequest"
        # beforeRequest: makeDownloadRequestVars
        json:
          room: "{{ room }}"
    - think: 2
    - post:
        url: "/api/downloadRequest"
        # beforeRequest: makeDownloadRequestVars
        json:
          room: "{{ room }}"