test/loadtest/getjsonatpath.yml
config:
  target: "http://localhost:3001"
  http:
    timeout: 10
  environments:
    production:
      target: "https://causalpath.org"
    staging:
      target: "http://35.192.108.199:3001"
    local:
      target: "http://localhost:3001"
  phases:
    - duration: 1
      arrivalRate: 20
      name: Load
  processor: "./processor.js"
scenarios:
  - flow:
    - post:
        url: "/api/getJsonAtPath"
        beforeRequest: makeGetJsonAtPathVars
        json:
          dir: "{{ path }}"