test/loadtest/mainpage.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 1
      arrivalRate: 20
      name: Load
  environments:
    production:
      target: "https://causalpath.org"
    staging:
      target: "http://35.192.108.199:3001"
    local:
      target: "http://localhost:3001"
scenarios:
  - flow:
    - get:
        url: "/mainpageloadtest"